num1 = 9  # Присваивает значение правого операнда левому
num2 = 4  # Присваивает значение правого операнда левому
num1 += num2  # Прибавит значение правого операнда левому и присвоит эту сумму левому операнду
print(num1)
num1 -= num2  # Отнимет значение правого операнда от левого и присвоит эту разность левому операнду
print(num1)
num1 *= num2  # Умножит значение левого операнда на правый и присвоит это произведение левому операнду
print(num1)
num1 /= num2  # Разделит значение левого операнда на правый и присвоит это частное левому операнду
print(num1)
num1 %= num2  # Найдет остаток от деления значение левого операнда на правый и присвоит этот остаток левому операнду
print(num1)
num1 = 9
num1 //= num2  # Разделит нацело значение левого операнда на правый и присвоит это частное левому операнду
print(num1)
num1 = 9
num1 **= num2  # Возведёт в степень, равную правому операнду, правый операнд и присвоит результат левому операнду
print(num1)